app/views/users/new.html.erb

SELECT "colors".* FROM "colors"
---
  <%= f.text_field :name %>
  <%= f.collection_check_boxes :color_ids, Color.all, :id, :name %>