app/views/users/show.html.erb

<ol>
  <% @user.colors.each do |color| %>
---
SELECT "colors".* FROM "colors" INNER JOIN "palettes" ON "colors"."id" = "palettes"."color_id" WHERE "palettes"."user_id" = ?  [["user_id", 1]]