app/views/colors/show.html.erb

<ul>
  <% @color.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "palettes" ON "users"."id" = "palettes"."user_id" WHERE "palettes"."color_id" = ?  [["color_id", 5]]