app/controllers/colors_controller.rb

SELECT "colors".* FROM "colors"
---
  def index
    @colors = Color.all

INSERT INTO "colors" ("name", "hexcode", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Obstinate Orange"], ["hexcode", "#D75530"], ["created_at", "2019-05-01 15:51:18.827516"], ["updated_at", "2019-05-01 15:51:18.827516"]]
---
  def create
    @color = Color.new(color_params)
    if @color.valid?
      @color.save

UPDATE "colors" SET "hexcode" = ?, "updated_at" = ? WHERE "colors"."id" = ?  [["hexcode", "#F08080"], ["updated_at", "2019-05-01 16:03:11.992063"], ["id", 2]]
---
  def update
    if @color.update(color_params)

DELETE FROM "colors" WHERE "colors"."id" = ?  [["id", 1]]
---
  def destroy
    @color.delete

SELECT  "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_color
    @color = Color.find(params[:id])