app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Noa"], ["created_at", "2019-05-01 16:41:23.855559"], ["updated_at", "2019-05-01 16:41:23.855559"]]